Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--virtualization_quickstart.tmx
Source language: en
Languages: ja

source: OSGeoLive Quickstart for Running in a Virtual Machine
ja: 仮想マシン内での OSGeoLive 起動クイックスタート

source: This Quick Start describes one way to run OSGeoLive within a VirtualBox virtual machine. For other methods, follow links from the "See Also" section below.
ja: ここでは、 OSGeo-Live を VirtualBox の仮想マシン内で動作させる1つの方法について記載します。他の方法については、以下の "参照" の章のリンクにしたがってください。

source: Virtual Machine Advantages
ja: 仮想マシンの利点

source: The response speed of a VM is much faster than on the DVD, and typically comparable with installing directly on the host machine.
ja: VMの応答速度はDVDよりもはるかに速く、通常はホストマシンに直接インストールするのと同等です。

source: All configuration changes, software updates, and saved files are permanent, just like on any "regular" computer. So:
ja: すべての構成変更、ソフトウェア更新、および保存されたファイルは、「通常の」コンピュータと同様に永続的です。So:

source: You can customize and update the system
ja: システムのカスタマイズとアップデートが可能です

source: You can save your work within the VM
ja: VM 内に作業状態を保存することが可能です

source: You can install additional software
ja: 追加のソフトウェアのインストールが可能です

source: You can backup your virtual machine installation.
ja: インストールした仮想マシンのバックアップが可能です

source: System Requirements
ja: 動作環境

source: RAM: 2 GB at least. The Lubuntu system runs well with 1 GB of RAM, and you'll need to keep at least the same amount of memory for your host system. So a total of 2 GB will be needed for smooth operation. Some applications, like GeoServer, needs the virtual machine to have at least 2GB of RAM. So if possible, consider providing 2 GB or more for your virtual machine.
ja: RAM:2GB以上Ubuntuシステムは1GBのRAMで正常に動作するので、ホストシステムと少なくとも同じ量のメモリを確保する必要があります。したがって、スムーズな動作には合計2GBが必要です。GeoServerなどの一部のアプリケーションでは、仮想マシンに2GB以上のRAMが必要です。可能であれば、仮想マシンに2GB以上のRAMを用意することを検討してください。

source: Spare Hard Disk Space: The virtual disk file (vmdk) from :doc:`live.osgeo.org <../download>` unzips to almost 10 GB. You'll also want more space to allow some room to work on the virtual machine. So 20 GB is a good recommendation.
ja: ハードディスクの空き容量:doc:`live.osgeo.org<./download>`の仮想ディスクファイル(vmdk)は、ほぼ10GBに解凍されます。また、仮想マシン上で作業できるスペースを確保するために、より多くのスペースが必要になります。したがって、20GBが推奨されます。

source: CPU: Any CPU will do, but a processor which supports "Virtualization Technology" will be faster. You can check your computer CPU `here <https://www.intel.com/content/www/us/en/support/articles/000005486/processors.html>`__.
ja: CPU: どのCPUでもかまいませんが、"Virtualization Technology"をサポートの方が高速です。あなたのコンピュータのCPUはここ<https://www.intel.com/content/www/us/en/support/articles/000005486/processors.html>で確認できます。

source: Most machines produced in the last 4-5 years will meet these requirements.
ja: この 4〜5 年で製造されたマシンのほとんどは、この要件を満たしています。

source: Howto
ja: 手順

source: **Downloads**
ja: **ダウンロード**

source: Download `Virtual Box <https://www.virtualbox.org/>`_ for your platform, and install the software. On Windows run the installer, or on Ubuntu-like Linux systems do the following:
ja: `Virtual Box<https://www.virtualbox.org/><https://www.virtualbox.org/>`_をダウンロードし、ソフトウェアをインストールしてください。Windowsでインストーラを実行するか、UbuntuのようなLinuxシステムで次の操作を行います。

source: In addition download the OSGeo Virtual disk file (vmdk) from :doc:`live.osgeo.org <../download>`. Click on the "Download virtual machine" button. Then unzip the downloaded file (using `7zip <https://www.7-zip.org>`_ ).
ja: さらに、doc:`live.osgeo.org<../download>`からOSGeo仮想ディスクファイル(vmdk)をダウンロードします。「Download virtual machine(仮想マシンのダウンロード)」ボタンをクリックします。次に、ダウンロードしたファイルを解凍します(`7zip<https://www7-zip.org>`_)。

source: **Create a Virtual Machine**
ja: **仮想マシンの作成**

source: Start the VirtualBox application and click on the New button to create a new VM, and then Next.
ja: VirtualBox アプリケーションを起動し、新しい VM を作成するために New ボタンをクリックし、Next をクリックします。

source: Enter a name such as OSGeoLive, and choose Linux as the "Operating system", and Ubuntu as the "Version".
ja: イメージに OSGeo-Live のような名前を付け、"Operating System" に Linux、"Version" に Ubuntu を選択します。

source: In the next screen set the memory to 1024 MB (or more if your host computer has more than 4GB, like in the screenshot below).
ja: 次の画面で、メモリを1024MBに設定します(下のスクリーンショットのように、ホストコンピュータのメモリが4GBを超える場合はそれ以上)。

source: Continue to the next screen and choose "Use an existing virtual hard disk file". Now click on the button (a folder icon) to browse to where you saved the OSGeoLive vmdk-file. Select this file, press Next and Create.
ja: 次の画面に進み、"既存の仮想ハードディスクファイルを使用する"を選択します。次に、ボタン(フォルダアイコン)をクリックして、OSGeoLive vmdkファイルを保存した場所を参照します。このファイルを選択し、[次へ]と[作成]を押します。

source: **Config tips and tweaks**
ja: **設定のヒントと微調整**

source: Once the VM is created, click on the Settings button. In the "General" section, go to the Advanced tab, and click to select "Show at top of screen" for the Mini toolbar.
ja: VMが作成されたら、[設定]ボタンをクリックします。[全般]セクションで、[詳細設定]タブに移動し、ミニツールバーの[画面上部に表示]をクリックして選択します。

source: Go to the "Display" section and increase video memory to 32 or 64 MB. In some host operating systems, it may be required to "Enable 3D Acceleration" for display to work properly.
ja: 「ディスプレイ」セクションに移動し、ビデオメモリを32MBまたは64MBに増やします。一部のホストオペレーティングシステムでは、表示を正しく機能させるために「3Dアクセラレータを有効にする]が必要になる場合があります。

source: In addition, move to the "Shared Folders" section, and click the "Add folder" (green + icon on the right) to find a directory on your host computer that you wish to share inside the VM.
ja: さらに、"Shared Folders" セクションに移動し、"Add folder" (右側の緑の "+" アイコン) をクリックし、VM 内部で共有したいホストコンピュータのディレクトリを指定します。

source: You can choose to make the shared folder read-only, and auto-mounted. Once the "Folder path" and "Folder name" are defined, click OK, and again OK to finish and close the settings window.
ja: 共有フォルダを読み取り専用にし、自動マウントすることもできます。「フォルダパス」と「フォルダ名」を定義したら、[OK]をクリックし、もう一度[OK]をクリックして設定ウィンドウを閉じます。

source: **Running the Virtual Machine**
ja: **仮想マシンの起動**

source: Now bootup the VM by clicking the Start (green arrow) button.
ja: Start (緑の矢印) ボタンをクリックして、VM を起動しましょう。

source: When you install the iso on the VM, the username must be set to "user"
ja: VMにisoをインストールする場合は、ユーザー名を「user」に設定する必要があります。

source: The user "user" is not a member of the "users" group on the OSGeoLive virtual machine. This prevents some tools from writing to its data directory and causes some software to fail to start.
ja: ユーザー「user」は、OSGeoLive仮想マシンの「users」グループのメンバーではありません。これにより、一部のツールがデータディレクトリに書き込みできなくなり、一部のソフトウェアが起動できなくなります。

source: The solution is to fix the vmdk with the following one-time procedure:
ja: この問題を解決するには、次の1回限りの手順でvmdkを修正します。

source: Start a terminal.
ja: 端末を起動します。

source: Run "sudo adduser user users".
ja: sudo adduser user usersを実行します。

source: Apply this change by starting a new desktop session: either restart the virtual machine or log out and log back in (username "user", password "user").
ja: この変更を適用するには、新しいデスクトップセッションを開始します。仮想マシンを再起動するか、ログアウトして再度ログインします(ユーザー名「user」、パスワード「user」)。

source: Also once the OSGeo system starts, add yourself to the vboxsf group so that the shared folders (defined above) are accessible by running in a terminal window:
ja: また、OSGeoシステムが起動したら、vboxsfグループに自分自身を追加し、ターミナルウィンドウでを実行して共有フォルダ(上記で定義)にアクセスできるようにします。

source: In the above example, we defined a Shared Folder path on the host system and named it "GIS" in the VM Settings. The shared folder will appear in the file system under /media/sf_GIS/. To mount this folder in the user's home directory, for example, in a terminal run:
ja: 上の例では、ホストシステム上に共有フォルダパスを定義し、VM設定で「GIS」という名前を付けました。共有フォルダは、ファイルシステムの/media/sf_GIS/の下に表示されます。このフォルダをユーザのホームディレクトリにマウントするには(たとえば、ターミナルで次のように実行します。

source: Now files on your host machine in the chosen folder will also be available in the VM in the "GIS" folder in user's home directory.
ja: これで、ホストマシンで選択したフォルダ内のファイルが、 VM 上のユーザのホームディレクトリ内の "GIS" フォルダでも利用可能になりました。

source: See Also:
ja: 参照:

source: OSGeo wiki pages:
ja: OSGeo Wiki ページ:

source: `Other ways to create a Virtual Machine <https://wiki.osgeo.org/wiki/Live_GIS_Virtual_Machine>`_
ja: `仮想マシンを作成するその他の方法<https://wiki.osgeo.org/wiki/Live_GIS_Virtual_Machine>`_
